//=============================================================================
//
// 飛行UIクラス[Fly.cpp]
// Author : AYANO KUDO
//
//=============================================================================
#include "Fly_ui.h"
#include "ui.h"
#include "texture.h"
#include "manager.h"
#include "resource_manager.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
//プレイヤごとのUIの位置
#define FLYUI_POS_PLAYER1 {SCREEN_WIDTH/4,SCREEN_HEIGHT/4-150.0f,0.0f}
#define FLYUI_POS_PLAYER2 {SCREEN_WIDTH/4+(SCREEN_WIDTH/2),SCREEN_HEIGHT/4-150.0f,0.0f}
#define FLYUI_POS_PLAYER3 {SCREEN_WIDTH/4,SCREEN_HEIGHT/4+(SCREEN_HEIGHT/2)-150.0f,0.0f}
#define FLYUI_POS_PLAYER4 {SCREEN_WIDTH/4+(SCREEN_WIDTH/2),SCREEN_HEIGHT/4+(SCREEN_HEIGHT/2)-150.0f,0.0f}

#define FLY_UI_SIZE_000 {128.0f,128.0f,0.0f}                        // UIのサイズ

//*****************************************************************************
// マクロ定義
//*****************************************************************************
const D3DXVECTOR3 CFly_UI::m_UIPos[MAX_PLAYER_NUM] =
{
    { FLYUI_POS_PLAYER1 },
    { FLYUI_POS_PLAYER2 },
    { FLYUI_POS_PLAYER3 },
    { FLYUI_POS_PLAYER4 }
};// プレイヤーごとのUIの位置

//=============================================================================
// [CFly_UI] コンストラクタ
//=============================================================================
CFly_UI::CFly_UI(void)
{
}

//=============================================================================
// [~CFly_UI] デストラクタ
//=============================================================================
CFly_UI::~CFly_UI()
{
}

//=============================================================================
// [Create] オブジェクトの生成
//=============================================================================
CFly_UI * CFly_UI::Create(void)
{
    CFly_UI *FlyUI = nullptr;
    if (FlyUI == nullptr)
    {
        // メモリの確保と初期化
        FlyUI = new CFly_UI;
        FlyUI->Init();
    }
    return FlyUI;
}

//=============================================================================
// [Init] 初期化処理
//=============================================================================
HRESULT CFly_UI::Init(void)
{
    return S_OK;
}

//=============================================================================
// [Init] 初期化処理
// 引数
// nPlayerNum　:　プレイヤーの番号
//=============================================================================
void CFly_UI::Init(int nPlayerNum)
{
    // テクスチャのポインタ取得
    CTexture *pTexture = CManager::GetResourceManager()->GetTextureClass();

    // プレイヤー番号を保存
    m_nPkayerNum = nPlayerNum;

    m_pUI = CUi::Create(m_UIPos[m_nPkayerNum], FLY_UI_SIZE_000);
    m_pUI->BindTexture(pTexture->GetTexture(CTexture::TEXTURE_NUM_SIDE_LINE));

}

//=============================================================================
// [Uninit]終了処理
//=============================================================================
void CFly_UI::Uninit(void)
{

        // !nullcheck
        if (m_pUI != nullptr)
        {
            // UIの終了処理
            m_pUI->Uninit();
            m_pUI = NULL;
        }
    Release();
}

//=============================================================================
// [Update] 更新処理
//=============================================================================
void CFly_UI::Update(void)
{
}

//=============================================================================
// [Draw] 描画処理
//=============================================================================
void CFly_UI::Draw(void)
{
}

//=============================================================================
// [SetFly] 飛行の設定
//=============================================================================
void CFly_UI::SetFly(void)
{
}

