//=============================================================================
//
// リザルト [result.h]
// Author : Yuuki Ikeda
//
//=============================================================================

#ifndef _RESULT_H_
#define _RESULT_H_
//=============================================================================
// インクルード
//=============================================================================
#include "main.h"
#include "polygon.h"
#include "player.h"
//=============================================================================
// リザルトクラス
//=============================================================================
class CResult : public CPolygon
{
public:
	CResult();     // コンストラクタ
	~CResult();    // デストラクタ

	HRESULT Init(void);		// 初期化処理
	void Uninit(void);		// 終了処理
	void Update(void);		// 更新処理
	void Draw(void);		// 描画処理

	static CResult* Create(D3DXVECTOR3 pos,D3DXVECTOR3 size,int nRank);    //ポリゴン生成処理

private:
	int m_nRank;										// 順位
};

#endif
