//=============================================================================
//
// 星の取得数UIヘッダ[star_ui.h]
// Author : AYANO KUDO
//
//=============================================================================
#ifndef  _STAR_UI_H_
#define _STAR_UI_H_

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"
#include "scene2d.h"

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CStar_UI : public CScene2D
{
public:
    CStar_UI();
    ~CStar_UI();

    static CStar_UI* Create(void);

    void Init(void);
    void Uninit(void);
    void Update(void);

private:
    // 2Dポリゴンへのポインタ
    // 星の取得数
};

#endif // ! _STAR_UI_H_
