//=============================================================================
//
// 制限時間UIヘッダ [time_ui.h]
// Author : AYANO KUDO
//
//=============================================================================
#ifndef  _TIME_UI_H_
#define _TIME_UI_H_

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"
#include "scene2d.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CTimer;
class CNumber2d;

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_NAM (3) // 表示する桁の数

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CTime_UI:public CScene2D
{
public:
    CTime_UI(PRIORITY Priority = PRIORITY_UI);
    ~CTime_UI();

    static CTime_UI* Create(void);

    void Init(void);
    void Uninit(void);
    void Update(void);
    void Draw(void);

    // Get関数
     CTimer *GetTimer(void) { return m_Timer; }

     void SetNumber(void);
private:
     CTimer    *m_Timer;                           // タイマーのポインタ
     CNumber2d *m_pNumber[MAX_NAM];                // ナンバーへのポインタ
};
#endif // ! _TIME_UI_H_
