#ifndef _ITEM_BOMB_H_
#define _ITEM_BOMB_H_
//=============================================================================
//
// アイテムボムクラスヘッダー	[item_bomb.h]
// Author : Konishi Yuuto
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "item.h"

//=============================================================================
// 前方宣言
//=============================================================================
class CItemBombBox;

//=============================================================================
// アイテムボムクラス
//=============================================================================
class CItemBomb : public CItem
{
public:
	CItemBomb(PRIORITY Priority = PRIORITY_1);		// コンストラクタ
	~CItemBomb();									// デストラクタ

	HRESULT Init(void);		// 初期化処理
	void Update(void);		// 更新処理

	void SetItem(void);									// アイテムの効果設定
	void UndoItem(void);								// アイテムの効果を戻す
	static CItemBomb *Create(const int nNumber);		// インスタンス生成

private:
	int m_nCounter;					// フレームカウンター
};

#endif