#ifndef _BG_H_
#define _BG_H_
//=============================================================================
//
// ゲーム背景クラスヘッダー [bg.h]
// Author : Konishi Yuuto
//
//=============================================================================

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"
#include "model.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define BG_POS		(ZeroVector3)	// 座標

#define BG_SIZE_X	(30.0f)			// 大きさ
#define BG_SIZE_Y	(30.0f)			// 大きさ
#define BG_SIZE_Z	(30.0f)			// 大きさ
#define BG_SIZE		(D3DXVECTOR3(BG_SIZE_X, BG_SIZE_Y, BG_SIZE_Z))		// 大きさ

//=============================================================================
// 背景クラス
//=============================================================================
class CBg : public CModel
{
public:
	CBg();		// コンストラクタ
	~CBg();		// デストラクタ

	HRESULT Init(D3DXVECTOR3 pos, D3DXVECTOR3 size);		// 初期化処理
	void Uninit(void);										// 終了処理
	void Update(void);										// 更新処理
	void Draw(void);										// 描画処理

	static CBg *Create(D3DXVECTOR3 pos, D3DXVECTOR3 size);	// インスタンス生成

private:
};

#endif
