#ifndef _QUEST_LOGO_H_
#define _QUEST_LOGO_H_
//=============================================================================
//
// クエストのロゴクラスヘッダー [quest_logo.h]
// Author : Konishi Yuuto
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "ui.h"

//=============================================================================
// マクロ定義
//=============================================================================

//=============================================================================
// クエストロゴクラス
//=============================================================================
class CQuestLogo : public CUi
{
public:
	CQuestLogo();		// コンストラクタ
	~CQuestLogo();	// デストラクタ

	static CQuestLogo *Create(void);	// オブジェクト生成

	HRESULT Init(D3DXVECTOR3 pos, D3DXVECTOR3 size);	// 初期化処理
	void Uninit(void);									// 終了処理
	void Update(void);									// 更新処理
	void Draw(void);									// 描画処理

private:
	int m_nEndCounter;		// 終了のカウンター
};

#endif
