#ifndef _UI_H_
#define _UI_H_
//=============================================================================
//
// UIクラスヘッダー	[ui.h]
// Author : Konishi Yuuto
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "scene2d.h"

//=============================================================================
// 前方宣言
//=============================================================================
class CScene2D;

//=============================================================================
// UIクラス
//=============================================================================
class CUi : public CScene2D
{
public:
	CUi(PRIORITY Priority = PRIORITY_UI);	// コンストラクタ
	~CUi();									// デストラクタ

	HRESULT Init(D3DXVECTOR3 pos, D3DXVECTOR3 size);			// 初期化処理
	void Uninit(void);											// 終了処理
	void Update(void);											// 更新処理
	void Draw(void);											// 描画処理

	static CUi *Create(D3DXVECTOR3 pos, D3DXVECTOR3 size);		// インスタンス生成

	// Set関数
	void SetUse(bool bUse);										// 使用フラグの設定
	
	// Get関数
	bool GetUse(void) { return m_bUse; }						// 使用フラグの情報

private:
	bool m_bUse;		// 使用するフラグ
};

#endif