#ifndef _STAGE_MAP_H_
#define _STAGE_MAP_H_
//=============================================================================
//
// マップの生成クラスヘッダー [stage_map.h]
// Author : Konishi Yuuto
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "main.h"
#include "star.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define MAP_LIMIT_Y		(2000.0f)		// マップの下限

//=============================================================================
// 前方宣言
//=============================================================================
class CMeshPillar;

//=============================================================================
// マップ生成クラス
//=============================================================================
class CStageMap
{
public:
	CStageMap();														// コンストラクタ
	~CStageMap();														// デストラクタ

	void Uninit(void);													// 終了処理
	void Update(void);													// 更新処理
	void CreateMap(void);												// アイテムクラスの生成

	static CStageMap *Create(void);										// インスタンス生成

	// Get関数
	CMeshPillar *GetMeshPillar(int nCount)				{ return m_pMeshPillar[nCount]; }	
	size_t GetMeshPillarNum(void)						{ return m_pMeshPillar.size(); }
private:
	std::vector<CMeshPillar*> m_pMeshPillar;	// アイテムボックスのポインタ
};
#endif
